## Creating TractorTEK mysql database

In [ ]:
pip install mysql-connector-python

In [2]:
import mysql.connector as mysql
import pandas as pd
from mysql.connector import Error

In [3]:
## creating connection to mysql and creating tractortek database ##

conn = mysql.connect(host='localhost', user='root', password='pw123')

if conn.is_connected():
    cursor = conn.cursor()
    cursor.execute("CREATE DATABASE tractortek")
    print("Database created successfully")
else:
    print("Error")

Database created successfully

## Creating tables in MySQL

In [9]:
prodMain = pd.read_csv(r"C:\Users\mdbro\OneDrive\Documents\teksystems_da\capstone1\prod_info.csv")
prodMain.head()

   id prod_code                   prod_name prod_manufc ext_serv_plan
0   1  PROD_006      ZT2000 Zero Turn Mower      Bobcat       ESP_006
1   2  PROD_005                   UV34 Gas       Bobcat       ESP_005
2   3  PROD_004  CT1021 Sub-Compact Tractor      Bobcat       ESP_004
3   4  PROD_007       S70 Skid Steer Loader      Bobcat       ESP_007
4   5  PROD_002                       CUV82         Cat       ESP_002

In [10]:
conn = mysql.connect(host='localhost', 
                     database='tractortek', 
                     user='root', 
                     password='pw123')
if conn.is_connected():
    cursor = conn.cursor()
    cursor.execute("select database();")
    record = cursor.fetchone()
    print("You're connected to the database: ", record)
    cursor.execute('DROP TABLE IF EXISTS prod_info;')
    print('Creating table')
    cursor.execute("CREATE TABLE prod_info(id INT, prod_code VARCHAR(8), prod_name VARCHAR(30), prod_manufc VARCHAR(30), ext_serv_plan VARCHAR(8))")
    print("Table is ready...")
    
    for i, row in prodMain.iterrows():
        sql = "INSERT INTO tractortek.prod_info VALUES (%s,%s,%s,%s,%s)"
        cursor.execute(sql, tuple(row))
        print("Records inserted")
        conn.commit()
else:
    print("Error connecting to Mysql")

You're connected to the database:  ('tractortek',)
Creating table
Table is ready...
Records inserted
Records inserted
Records inserted
Records inserted
Records inserted
Records inserted
Records inserted
Records inserted

In [3]:
empTbl = pd.read_csv(r"C:\Users\mdbro\OneDrive\Documents\teksystems_da\capstone1\emp_tbl.csv")
empTbl.head()

    empid         team_lead pay_grd region
0  EMP244       Evans, Gina     C12     NW
1  EMP256     Lawson, Harry     C11     NW
2  EMP234    Bachmann, Jane     C13     NW
3  EMP267  Clement, Beverly     C14     SW
4  EMP290      Allen, Maude     C12     SW

In [4]:
conn = mysql.connect(host='localhost', 
                     database='tractortek', 
                     user='root', 
                     password='pw123')
if conn.is_connected():
    cursor = conn.cursor()
    cursor.execute("select database();")
    record = cursor.fetchone()
    print("You're connected to the database: ", record)
    cursor.execute('DROP TABLE IF EXISTS emp_tbl;')
    print('Creating table')
    cursor.execute("CREATE TABLE emp_tbl(empid VARCHAR(10), team_lead VARCHAR(30), pay_grd VARCHAR(30), region VARCHAR(8))")
    print("Table is ready...")
    
    for i, row in empTbl.iterrows():
        sql = "INSERT INTO tractortek.emp_tbl VALUES (%s,%s,%s,%s)"
        cursor.execute(sql, tuple(row))
        print("Records inserted")
        conn.commit()
else:
    print("Error connecting to Mysql")

You're connected to the database:  ('tractortek',)
Creating table
Table is ready...
Records inserted
Records inserted
Records inserted
Records inserted
Records inserted